app/controllers/questions_controller.rb

  def mapping_list
    mappings = Mapping.all
---
SELECT "mappings".* FROM "mappings"

  def role_list
    roles = Role.all
---
SELECT "roles".* FROM "roles"